angular.module('starter.services', [])

.factory('clubs', function() {

  var clubs = [
    {
    id: 1,

    // contact May Wisut - 0845540926
    name: 'SKN Wave',
    poster: null,
    excerpt: 'connect speed broadcast',
    story:'ประกาศข่าวสารต่างๆจากคุณครูและนักเรียน ทำสูจิบัตรวันงานกิจกรรมต่างๆประกาศเสียงตามสายจดหมายข่าววารสารเผยแพร่ข่าวสารให้แกคนในโรงเรียน ',
    activity:' ร่วมสนุกกับบอร์ด "สิ่งที่อยากบอกกับโรงเรียน" ให้มาถ่ายรูป  แนะนำโรงเรียนกับกับบุคลภายนอก เมื่อร่วมกิจกรรมได้รับฟรี! ที่คั่นหนังสือที่ระลึกจากชุมนุมของเรา  นอกจากนี้เรายังมีซุ้มขาย อิตาเลี่ยนโซดา สีพาสเทลมากมาย ',
    clublogo:'ion-android-wifi',
    clubid:'-',
    coverimg:'img/wave.png',
    promo:'PRSKNE'
  },

  {
    id: 2,

    // contact Patis Jantron - 0820891714
    name: 'ลูกเสือ',
    excerpt: 'ลูกเสือ? หลายๆคนอาจจะคิดถึงการแต่งเครื่องแบบร้อนๆ ระเบียบแถวกลางแดด ผูกเงื่อน... ลูกเสือมีอะไรมากกว่าที่คุณคิด! มาหาคำตอบด้วยกันสิฮะ',
    poster: null,
    story:'JAMBOREE จริงๆแล้วแปลเป็นภาษาไทยคือ งานชุมนุมลูกเสือ พูดง่ายๆคือการที่ลูกเสือจำนวนมากมาอยู่ร่วมกันและทำกิจกรรมต่าๆร่วมกัน มันสนุกมากๆเลยล่ะ! ในปีที่ผ่านๆมานี้ ชุมนุมลูกเสือได้ส่งสมาชิกไปเป็นผู้แทนคณะลูกเสือไทย ไปร่วมงานชุมนุมลูกเสือยังต่างประเทศมากมายหลายครั้ง ตัวอย่างเช่น ญี่ปุ่น เกาหลี สหรัฐอเมริกา สวีเดนฟิลิปปินส์ เบลเยี่ยม และแน่นอน งานชุมนุมลูกเสือโลก ครั้งที่ 23 ณ ประเทศญี่ปุ่น  ในงานสวนนนท์ปริทรรศน์ปีนี้ เราได้จัดทำนิทรรศการเพื่อบอกเล่าเรื่องราวในสิ่งที่คุณอาจจะยังไม่รุ้เกี่ยวกับลูกเสือ ถึงความสนุกที่เราอยากชวนให้คุณลองมาสัมผัส พบกันได้ที่ลานอเนกประสงค์นะฮะ และแน่นอน เราก็ยังมีการจำลองค่ายงานชุมนุมลูกเสือโลกครั้งที่ 23 ณ ประเทศญี่ปุ่นใน theme Kitty Scout ที่บริเวณสนามฟุตบอลอีกด้วยนะ  อย่าลืมมาชมกันล่ะ ',
    activity:'กิจกรรม Rally ชิงรางวัล เริ่มต้นที่นิทรรศการของเราบริเวณลานอเนกประสงค์ ต่อด้วยค่ายจำลองที่สนามฟุตบอล...กินหมูปิ้งฟรีด้วยนะ มาเสื้อลายสวยๆมาจำหน่ายด้วย',
    clublogo:'ion-ios-flame',
    clubid:'ก075',
    coverimg:'img/scout.png',
    promo:'kittyscout'
  },

  {
    id: 3,

    // contact Ittipond Chaiya - 0085-259-8944
    name: 'Suannon Freedom',
    poster: null,
    excerpt: 'ทุกๆเรื่องที่คุณไม่เคยรู้มาก่อนเกี่ยวกับสวนกุหลาบเราได้รวบรวมไว้ที่นี่แล้ว พบกับกิจกรรมมากมายที่คุณต้องไม่พลาด แล้วมาพับกัน Suannon Freedom',
    story:' พวกเราสร้างความรู้ความเข้าใจในความเป็นสวนกุหลาบ - เป็นผู้นำ รักเพื่อน นับถือพี่ เคารพครู กตัญญูพ่อแม่ ดูแลน้อง ',
    activity:'กิจกรรมแลกรับของรางวัลจากเรา เกมส์ล้วงไข่เย็น และ ศึกสวนกุหลาบ',
    clublogo:'ion-ios-infinite',
    clubid:'ก040',
    coverimg:'img/freedom.png',
    promo:'suannonfreedom'
  },

  {
    id: 4,

    //  นภัสสร เผ่าพันธุ์ (พลอย) - 086-784-1836 - fb.me/Ploynapatsorn
    name: 'ภาษาญี่ปุ่น',
    poster: null,
    excerpt: 'ก้าวแรกกับการเรียนภาษาญี่ปุ่น ',
    story: 'ชุมนุมภาษาญี่ปุ่นจัดตั้งขึ้น สำหรับคนที่มีความสนใจใน ภาษาและวัฒนธรรมของญี่ปุ่น มีการสอนภาษาญี่ปุ่นเบื้องต้น และเรียนรู้วัฒนธรรมของชาวญี่ปุ่นไปด้วย มีการสอนการทำทาโกะยากิ อาหารขึ้นชื่อของญี่ปุ่น การพับกระดาษโอริงามิ การลองใส่ยูกาตะ โดยมีการเชิญวิทยากรชาวญี่ปุ่นมาสอนด้วย',
    activity:'ปีนี้มาในคอนเซ็ปต์ เรียวคัง โรงแรมสไตล์ญี่ปุ่นดั้งเดิม ที่จะนำเสนอวัฒนธรรมของชาวญี่ปุ่น มีการตอบปัญหาความรู้ทั่วไปประเทศญี่ปุ่น ชิงของรางวัลมากมาย รวมทั้งมีการขายทาโกะยากิ และมีการให้ได้ลองสวมชุดยูกาตะ ซึ่งมีทั้งชุดของผู้หญิงและผู้ชายด้วย',
    clublogo:'ion-ios-flower',
    clubid:'ก072',
    coverimg:'img/japanese.png',
    promo:'esenapa'
  },

  {
    id: 5,

    //  Pamtaem Shawol
    name: 'NextStep',
    poster: null,
    excerpt: 'อย่าลืมมาดูพวกเรา Next Step ชุมนุม cover dance ชุมนุมเดียวของโรงเรียน ',
    story: 'พวกเราคือชุมนุมเต้น Cover Dance เพลงของศิลปินเกาหลีชื่อดังหลายวงอย่างที่หลายๆคนรู้จักกันดี',
    activity:'มีการแสดง Talent Show ทั้งหมดถึง 3 ชุดการแสดงบนเวทีหลัก',
    clublogo:'ion-android-walk',
    clubid:'ก028',
    coverimg:'img/nextstep.png',
    promo:'asianstepn'
  },

  {
    id: 6,

    //  Chananya Charoenpiam - 095-054-8884
    name: 'English Club',
    poster: null,
    excerpt: 'Here is English Airlines Captain. Everything is ready for you -- prizes,  snacks, knowledge and a great great services. Hope to see you there, wont you ?',
    story: 'English Club เราคือชุมนุมที่คาดหวังที่จะสร้างทัศนคติในเชิงบวกรวมถึงความมั่นใจในการติดต่อสื่อสารด้วยภาษาอังกฤษอย่างถูกต้องและเหมาะสม',
    activity:'เกมจับคู่คำศัพท์ โดยกติกาจะให้จำคำศัพท์ทั้งสิ้น 20 คำ ในเวลาที่จำกัด พยายามจับคู่คำศัพท์ให้ถูกต้องมากที่สุด เพื่อหอบและกอบโกยของรางวัลที่ดีที่สุดกลับไป!  ในการเข้าร่วมกิจกรรมผู้โดยสารจะต้องมี "Ticket หรือ ตั๋ว" ซึ่งหาซื้อได้จากพนักงานของเรา หรือมีจำหน่ายที่หน้าบูธกิจกรรม',
    clublogo:'ion-social-angular-outline',
    clubid:'ก015',
    coverimg:'img/english.png',
    promo:'passengercode'
  },

  {
    id: 7,

    //  Apatsara Khamsa-ard
    name: 'Cartoon Talk',
    poster: null,
    excerpt: 'โม้โคตรๆเรื่องการ์ตูน',
    story: 'ชุมนุมของพวกเรา ดูการ์ตูน เล่นเกม อ่านการ์ตูน ฟังเพลง ร้องเพลง',
    activity:'กิจกรรมเกมบิงโก !! ลุ้นรับของรางวัลจากชุมนุม',
    clublogo:'ion-chatbox-working',
    clubid:'ก008',
    coverimg:'img/cartoon.png',
    promo:'ctn555'
  },

  {
    id: 8,

    //  Jirapornchai tanapat - 081-104-3554
    name: 'SKN Golf Club',
    poster: null,
    excerpt: 'ถึงแม้คุณจะไม่เคยเล่นกอล์ฟ แต่ชุมนุมเราสามารถทำให้คุณชอบมันได้ และสามารถดูกีฬาเป็นเพิ่มขึ้นอีก 1 ชนิด',
    story: 'ชุมนุมของพวกเรา สอนให้คนทั่วไปเข้าใจ และสามารถ สนึกไปกับกีฬากอล์ฟได้',
    activity:'ชุมนุมเราของเหลือเยอะครับ อยากแจก!! เพียงคุณลงแค่1 ลูก เรารับประกันว่าจะไม่มีการกลับบ้านมือเปล่าแน่นอน ',
    clublogo:'ion-record',
    clubid:'ก036',
    coverimg:'img/golf.png',
    promo:'skngolfclub'
  },

  {
    id: 9,

    //  พณรัฐ ชาทอง - 0918795933
    name: 'รักษ์โรงเรียน',
    poster: null,
    excerpt: 'ดูแลรักษาสิ่งต่างในโรงเรียน',
    story: 'ชุมนุมของพวกเรา ทาสีเส้นจอดรถ ทำกล่องทิ้งถ้าอนามัน ฯลฯ ',
    activity:'ภายในซุ้ม มีการแสดงภาพการทำกิจกรรมของคนในชุมนุม ',
    clublogo:'ion-settings',
    clubid:'ก073',
    coverimg:'img/schoolrp.png',
    promo:'eskn'


  },

  {
    id: 10,

    //  Prai Pannapat - 0843260185
    name: 'Drawing Freedom',
    poster: null,
    excerpt: 'มาเจอกับพวกเราได้ที่ซุ้มDrawing Freedom งานดีน้ำอร่อยเก๋ไก๋ไม่เหมือนใคร',
    story:'ชุมนุมของเราจะให้สมาชิคในชุมนุมวาดรูปอะไรก็ได้ในกระดาษหนึ่งแผ่นโดยกำหนดหัวข้อให้เล็กแล้วบรรยายออกมาเป็นรูปภาพ',
    activity:'ภายในซุ้มจะมีการจัดโชว์ผลงานที่คนภายในชุมนุมได้ทำ และมีการขายน้ำที่ให้เพื่อนๆที่มาซื้อได้เขียนเเก้วแล้วยังมีบริการส่งให้ผู้อื่นได้อีกด้วย',
    clublogo:'ion-edit',
    clubid:'ก013',
    coverimg:'img/draw.png',
    promo:'domfreeingdraw'


  },

  {
    id: 11,

    //  ปิยะณัฐ  วงศ์เดชงาม 0873637412
    name: 'FDPHOTO',
    poster: null,
    excerpt: 'Story of Photo',
    story:'แชร์เรื่องราวความสุขในแต่ละมุมมองของคนในชุมนุม ถ่ายทอดออกมาเป็นภาพถ่าย',
    activity:'ขายน้ำหลากสี และ บริการถ่ายภาพโพลาลอยด์',
    clublogo:'ion-ios-camera',
    clubid:'ก019',
    coverimg:'img/fdphoto.png',
    promo:'pikachuuu'


  },

  {
    id: 12,

    //  Totsuka Tatara - 0898978429
    name: 'Lunatic_Circle VIII',
    poster: null,
    excerpt: 'คุณกำลังมองหา สินค้าแฮนด์เมดสวยๆใช่หมือไร่? พวกเรามีของที่คุณกำลังตามหาอยู่ มาได้ที่นี่ ที่ Lunatic_Circle VIII',
    story:'ชุมนุม Lunatic_Circle VIII ตั้งขึ้นมาเพื่อจะได้ให้สมาชิกและน้องๆในชุมนุมได้ฝึกฝนพื้นฐานด้านการวาดรูปและแลกเปลี่ยนข้อมูลกับเพื่อนๆภายในชุมนุมเรื่องเดียวกันเพื่อหาเพื่อนที่ชอบเรื่องเดียวกันและได้วาดรูปทำกิจกรรมภายในชุมนุมร่วมกัน',
    activity:'ขายสินค้าแฮนด์เมดเกี่ยวกับการ์ตูนยอดนิยม และขายของที่ระลึกของนักเรียนสวนกุหลาบ ชุมนุม Lunatic_Circle VIII',
    clublogo:'ion-android-hand',
    clubid:'ก026',
    coverimg:'img/lunatic.png',
    promo:'odoroitaka?'


  },

  {
    id: 13,

    //   มิ้นท์ ณัฐฐินันท์ - 084-595-7824
    name: 'ศุภนิตย์ MATH',
    poster: null,
    excerpt: 'เพิ่มรอยหยักกับศุภนิตย์ MATH',
    story:'จัดสอน PAT1 และติวการสอบ O-NET ให้นักเรียนได้เตรียมตัวและเข้าใจในเรื่องที่จะใช้สอบมากยิ่งขึ้น',
    activity:'แสดงผลงานด้านคณิตศาตร์ของสมาชิกในชุมนุม',
    clublogo:'ion-android-add',
    clubid:'ก078',
    coverimg:'img/math.png',
    promo:'spnmath'


  }


];

  return {
    all: function() {
      return clubs;
    },
    remove: function(club) {
      clubs.splice(clubs.indexOf(club), 1);
    },
    get: function(clubId) {
      for (var i = 0; i < clubs.length; i++) {
        if (clubs[i].id === parseInt(clubId)) {
          return clubs[i];
        }
      }
      return null;
    }
  };
});
